ERP.belugaerp/src/Catalogs/ВидыНоменклатуры/ВидыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ВидыНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>АлкогольнаяПродукция</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>бг_ВариантСинхронизацииWMS</name>
    <type>
      <types>EnumRef.бг_ВариантыСинхронизацииНоменклатурыWMS</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ВедетсяВERP</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ВидКлассификатораНСИ</name>
    <type>
      <types>EnumRef.бг_ВидКлассификатораНСИ</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ВидОперацииНалогообложенияАкцизом</name>
    <type>
      <types>CatalogRef.бг_ВидыОперацийНалогообложенияАкцизом</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ЕдиницаИзмеренияМест</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ИспользоватьЗаявлениеОВыдачеФСМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ИспользоватьКонечныйНомерДиапазона</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ИспользоватьНакладнаяНаВыдачуФСМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ИспользоватьНачальныйНомерДиапазона</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ИспользоватьНомерДиапазонаВРулоне</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ИспользоватьНомерРулона</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ИспользоватьСериюМарки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_НеФормироватьНаименованиеПоШаблону</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_ОграничиватьДобавлениеИзменениеНоменклатуры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_УстановитьДействиеОтгрузитьВЗаказеПриЗагрузкеРТиУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>бг_УчетОстатковИРезервовВРазрезеУпаковокПаллет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользованиеХарактеристик</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьДатуПроизводстваСерии</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьСерии</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьСрокГодностиСерии</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОсобенностьУчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>ПолитикиУчетаСерий</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Склад</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ПолитикаУчетаСерий</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ERP.belugaerp/src/Catalogs/ВидыНоменклатуры/ManagerModule.bsl
&Вместо("ОписанияИспользованияРеквизитовСерии")
Функция бг_ОписанияИспользованияРеквизитовСерии(НастройкиИспользованияСерий = Неопределено, ПараметрыУказанияСерий = Неопределено, ЗначенияПолейСвязи = Неопределено) Экспорт

	ОписанияИспользованияРеквизитовСерии = ПродолжитьВызов(НастройкиИспользованияСерий, ПараметрыУказанияСерий, ЗначенияПолейСвязи);
	
	ЭтоФСМ = НастройкиИспользованияСерий.ВидНоменклатуры = бг_КонстантыПовтИсп.ЗначениеКонстанты("ФедеральнаяСпецМарка");
	
	ОписаниеИспользованиеРеквизитаСерии = ОписаниеИспользованиеРеквизитаСерии();
	ОписаниеИспользованиеРеквизитаСерии.ИмяРеквизита = "бг_СерияМарки";
	ОписаниеИспользованиеРеквизитаСерии.ПредставлениеРеквизита
		= Метаданные.Справочники.СерииНоменклатуры.Реквизиты.бг_СерияМарки.Представление();
	ОписаниеИспользованиеРеквизитаСерии.ИмяНастройки = "бг_ИспользоватьСериюМарки";
	ОписаниеИспользованиеРеквизитаСерии.ТекстШаблонаНаименования = НСтр("ru = '%бг_СерияМарки%'");
	ОписаниеИспользованиеРеквизитаСерии.Использование       = НастройкиИспользованияСерий[ОписаниеИспользованиеРеквизитаСерии.ИмяНастройки];
	ОписаниеИспользованиеРеквизитаСерии.ПроверятьЗаполнение = ЭтоФСМ;
	ОписанияИспользованияРеквизитовСерии.Добавить(ОписаниеИспользованиеРеквизитаСерии);
	
	ОписаниеИспользованиеРеквизитаСерии = ОписаниеИспользованиеРеквизитаСерии();
	ОписаниеИспользованиеРеквизитаСерии.ИмяРеквизита = "бг_НомерРулона";
	ОписаниеИспользованиеРеквизитаСерии.ПредставлениеРеквизита
		= Метаданные.Справочники.СерииНоменклатуры.Реквизиты.бг_НомерРулона.Представление();
	ОписаниеИспользованиеРеквизитаСерии.ИмяНастройки = "бг_ИспользоватьНомерРулона";
	ОписаниеИспользованиеРеквизитаСерии.ТекстШаблонаНаименования = НСтр("ru = '%бг_НомерРулона%';|en = '%бг_НомерРулона%'");
	ОписаниеИспользованиеРеквизитаСерии.Использование = НастройкиИспользованияСерий[ОписаниеИспользованиеРеквизитаСерии.ИмяНастройки];
	ОписаниеИспользованиеРеквизитаСерии.ПроверятьЗаполнение = ЭтоФСМ;
	ОписанияИспользованияРеквизитовСерии.Добавить(ОписаниеИспользованиеРеквизитаСерии);
	
	ОписаниеИспользованиеРеквизитаСерии = ОписаниеИспользованиеРеквизитаСерии();
	ОписаниеИспользованиеРеквизитаСерии.ИмяРеквизита = "бг_НомерДиапазонаВРулоне";
	ОписаниеИспользованиеРеквизитаСерии.ПредставлениеРеквизита
		= Метаданные.Справочники.СерииНоменклатуры.Реквизиты.бг_НомерДиапазонаВРулоне.Представление();
	ОписаниеИспользованиеРеквизитаСерии.ИмяНастройки = "бг_ИспользоватьНомерДиапазонаВРулоне";
	ОписаниеИспользованиеРеквизитаСерии.ТекстШаблонаНаименования = НСтр("ru = '%бг_НомерДиапазонаВРулоне%';|en = '%бг_НомерДиапазонаВРулоне%'");
	ОписаниеИспользованиеРеквизитаСерии.Использование = НастройкиИспользованияСерий[ОписаниеИспользованиеРеквизитаСерии.ИмяНастройки];
	ОписаниеИспользованиеРеквизитаСерии.ПроверятьЗаполнение = ЭтоФСМ;
	ОписанияИспользованияРеквизитовСерии.Добавить(ОписаниеИспользованиеРеквизитаСерии);
	
	ОписаниеИспользованиеРеквизитаСерии = ОписаниеИспользованиеРеквизитаСерии();
	ОписаниеИспользованиеРеквизитаСерии.ИмяРеквизита = "бг_НачальныйНомерДиапазона";
	ОписаниеИспользованиеРеквизитаСерии.ПредставлениеРеквизита
		= Метаданные.Справочники.СерииНоменклатуры.Реквизиты.бг_НачальныйНомерДиапазона.Представление();
	ОписаниеИспользованиеРеквизитаСерии.ИмяНастройки = "бг_ИспользоватьНачальныйНомерДиапазона";
	ОписаниеИспользованиеРеквизитаСерии.ТекстШаблонаНаименования = НСтр("ru = '%бг_НачальныйНомерДиапазона%'");
	ОписаниеИспользованиеРеквизитаСерии.Использование       = НастройкиИспользованияСерий[ОписаниеИспользованиеРеквизитаСерии.ИмяНастройки];
	ОписаниеИспользованиеРеквизитаСерии.ПроверятьЗаполнение = ЭтоФСМ;
	ОписанияИспользованияРеквизитовСерии.Добавить(ОписаниеИспользованиеРеквизитаСерии);
	
	ОписаниеИспользованиеРеквизитаСерии = ОписаниеИспользованиеРеквизитаСерии();
	ОписаниеИспользованиеРеквизитаСерии.ИмяРеквизита = "бг_КонечныйНомерДиапазона";
	ОписаниеИспользованиеРеквизитаСерии.ПредставлениеРеквизита
		= Метаданные.Справочники.СерииНоменклатуры.Реквизиты.бг_КонечныйНомерДиапазона.Представление();
	ОписаниеИспользованиеРеквизитаСерии.ИмяНастройки = "бг_ИспользоватьКонечныйНомерДиапазона";
	ОписаниеИспользованиеРеквизитаСерии.ТекстШаблонаНаименования = НСтр("ru = '%бг_КонечныйНомерДиапазона%'");
	ОписаниеИспользованиеРеквизитаСерии.Использование       = НастройкиИспользованияСерий[ОписаниеИспользованиеРеквизитаСерии.ИмяНастройки];
	ОписаниеИспользованиеРеквизитаСерии.ПроверятьЗаполнение = ЭтоФСМ;
	ОписанияИспользованияРеквизитовСерии.Добавить(ОписаниеИспользованиеРеквизитаСерии);
	
	ОписаниеИспользованиеРеквизитаСерии = ОписаниеИспользованиеРеквизитаСерии();
	ОписаниеИспользованиеРеквизитаСерии.ИмяРеквизита = "бг_ЗаявлениеОВыдачеФСМ";
	ОписаниеИспользованиеРеквизитаСерии.ПредставлениеРеквизита
		= Метаданные.Справочники.СерииНоменклатуры.Реквизиты.бг_ЗаявлениеОВыдачеФСМ.Представление();
	ОписаниеИспользованиеРеквизитаСерии.ИмяНастройки = "бг_ИспользоватьЗаявлениеОВыдачеФСМ";
	ОписаниеИспользованиеРеквизитаСерии.ТекстШаблонаНаименования = НСтр("ru = '%бг_ЗаявлениеОВыдачеФСМ%'");
	ОписаниеИспользованиеРеквизитаСерии.Использование       = НастройкиИспользованияСерий[ОписаниеИспользованиеРеквизитаСерии.ИмяНастройки];
	ОписаниеИспользованиеРеквизитаСерии.ПроверятьЗаполнение = ЭтоФСМ;
	ОписанияИспользованияРеквизитовСерии.Добавить(ОписаниеИспользованиеРеквизитаСерии);
	
	ОписаниеИспользованиеРеквизитаСерии = ОписаниеИспользованиеРеквизитаСерии();
	ОписаниеИспользованиеРеквизитаСерии.ИмяРеквизита = "бг_НакладнаяНаВыдачуФСМ";
	ОписаниеИспользованиеРеквизитаСерии.ПредставлениеРеквизита
		= Метаданные.Справочники.СерииНоменклатуры.Реквизиты.бг_НакладнаяНаВыдачуФСМ.Представление();
	ОписаниеИспользованиеРеквизитаСерии.ИмяНастройки = "бг_ИспользоватьНакладнаяНаВыдачуФСМ";
	ОписаниеИспользованиеРеквизитаСерии.ТекстШаблонаНаименования = НСтр("ru = '%бг_НакладнаяНаВыдачуФСМ%'");
	ОписаниеИспользованиеРеквизитаСерии.Использование       = НастройкиИспользованияСерий[ОписаниеИспользованиеРеквизитаСерии.ИмяНастройки];
	ОписаниеИспользованиеРеквизитаСерии.ПроверятьЗаполнение = ЭтоФСМ;
	ОписанияИспользованияРеквизитовСерии.Добавить(ОписаниеИспользованиеРеквизитаСерии);
	
	Возврат ОписанияИспользованияРеквизитовСерии;

КонецФункции

&Вместо("РеквизитыНастройкиУказанияСерий")
Функция бг_РеквизитыНастройкиУказанияСерий()
	
	РеквизитыНастройкиУказанияСерий = ПродолжитьВызов();
	
	РеквизитыНастройкиУказанияСерий.Добавить("бг_ИспользоватьСериюМарки");
	РеквизитыНастройкиУказанияСерий.Добавить("бг_ИспользоватьНомерРулона");
	РеквизитыНастройкиУказанияСерий.Добавить("бг_ИспользоватьНомерДиапазонаВРулоне");
	РеквизитыНастройкиУказанияСерий.Добавить("бг_ИспользоватьНачальныйНомерДиапазона");
	РеквизитыНастройкиУказанияСерий.Добавить("бг_ИспользоватьКонечныйНомерДиапазона");
	
	РеквизитыНастройкиУказанияСерий.Добавить("бг_ИспользоватьЗаявлениеОВыдачеФСМ");
	РеквизитыНастройкиУказанияСерий.Добавить("бг_ИспользоватьНакладнаяНаВыдачуФСМ");
	
	Возврат РеквизитыНастройкиУказанияСерий;
	
КонецФункции
